In [1]:
import numpy as np
import pandas as pd

In [5]:
#merging by a common key
left=pd.DataFrame({'key':['k0','k1','k2','k3'],
                  'a':['a0','a1','a2','a3'],
                  'b':['b0','b1','b2','b3']})


right=pd.DataFrame({'key':['k0','k1','k2','k3'],
                   'c':['c0','c1','c2','c3'],
                   'd':['d0','d1','d2','d3']})

In [7]:
print("\nThe Dataframe'left'\n",'-'*30,sep='')
print(left)

The Dataframe'left'
------------------------------
  key   a   b
0  k0  a0  b0
1  k1  a1  b1
2  k2  a2  b2
3  k3  a3  b3

In [8]:
print("\nThe Dataframe'right'\n",'-'*30,sep='')
print(right)

The Dataframe'right'
------------------------------
  key   c   d
0  k0  c0  d0
1  k1  c1  d1
2  k2  c2  d2
3  k3  c3  d3

In [12]:
merge1=pd.merge(left,right,how='inner',on = 'key')
print("\nAfter simple merging with 'inner'method\n",'-'*50,sep='')
print(merge1)

After simple merging with 'inner'method
--------------------------------------------------
  key   a   b   c   d
0  k0  a0  b0  c0  d0
1  k1  a1  b1  c1  d1
2  k2  a2  b2  c2  d2
3  k3  a3  b3  c3  d3

In [39]:
#join operator
left=pd.DataFrame({'a':['a0','a1','a2','a3'],
                  'b':['b0','b1','b2','b3']},
                 index=['k0','k1','k2','k3'])


right=pd.DataFrame({'c':['c0','c1','c2','c3'],
                   'd':['d0','d1','d2','d3']},
                  index=['k0','k2','k3','k4'])

In [33]:
left

     a   b
k0  a0  b0
k1  a1  b1
k2  a2  b2
k3  a3  b3

In [34]:
right

     c   d
k0  c0  d0
k2  c1  d1
k3  c2  d2
k4  c3  d3

In [35]:
left.join(right)

     a   b    c    d
k0  a0  b0   c0   d0
k1  a1  b1  NaN  NaN
k2  a2  b2   c1   d1
k3  a3  b3   c2   d2

In [43]:
left.join(right,how ='outer')

      a    b    c    d
k0   a0   b0   c0   d0
k1   a1   b1  NaN  NaN
k2   a2   b2   c1   d1
k3   a3   b3   c2   d2
k4  NaN  NaN   c3   d3

In [44]:
#use of apply functions
#define a function
def testfunc(x):
    if(x>500):
        return(10*np.log10(x))
    else:
        return(x/10)

In [48]:
df=pd.DataFrame({'cal1':[1,2,3,4,5,6,7,8,9,10],
                'col2':[444,555,666,444,333,222,666,777,666,555],
                'col3':['aaa','bb','c','dd','eeee','fff','gg','h','iii','j']})
df

   cal1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444    dd
4     5   333  eeee
5     6   222   fff
6     7   666    gg
7     8   777     h
8     9   666   iii
9    10   555     j

In [52]:
df['funcapplied'] = df['cal1'].apply(testfunc)
print(df)

   cal1  col2  col3  col3 lenght  funcapplied
0     1   444   aaa            3          0.1
1     2   555    bb            2          0.2
2     3   666     c            1          0.3
3     4   444    dd            2          0.4
4     5   333  eeee            4          0.5
5     6   222   fff            3          0.6
6     7   666    gg            2          0.7
7     8   777     h            1          0.8
8     9   666   iii            3          0.9
9    10   555     j            1          1.0

In [65]:
df['col3 lenght']=df['col3'].apply(len)
df

   cal1  col2  col3  col3 lenght  funcapplied
0     1   444   aaa            3          0.1
1     2   555    bb            2          0.2
2     3   666     c            1          0.3
3     4   444    dd            2          0.4
4     5   333  eeee            4          0.5
5     6   222   fff            3          0.6
6     7   666    gg            2          0.7
7     8   777     h            1          0.8
8     9   666   iii            3          0.9
9    10   555     j            1          1.0

In [55]:
df['funcapplied'].apply(lambda x:np.sqrt(x))

0    0.316228
1    0.447214
2    0.547723
3    0.632456
4    0.707107
5    0.774597
6    0.836660
7    0.894427
8    0.948683
9    1.000000
Name: funcapplied, dtype: float64

In [56]:
print("\nsum of the column'funcapplied'is:",df['funcapplied'].sum())

sum of the column'funcapplied'is: 5.5

In [57]:
print('\n min and max of the column"funcapplied"are:',df['funcapplied'].min(),'and',df['funcapplied'].max())

 min and max of the column"funcapplied"are: 0.1 and 1.0

# Deletion,sorting,list of column and row names

In [60]:
print("\n Name of column \n",'-'*20,sep='')
print(df.columns)

 Name of column
--------------------
Index(['cal1', 'col2', 'col3', 'col3 lenght', 'funcapplied'], dtype='object')

In [62]:
l=list(df.columns)
print("\n columns names in a list of string for later manipulation:",l)

 columns names in a list of string for later manipulation: ['cal1', 'col2', 'col3', 'col3 lenght', 'funcapplied']

In [67]:
print("\nDeletion last column by 'del'command\n",'-'*50,sep='')
del df['col3 lenght']
print(df)

Deletion last column by 'del'command
--------------------------------------------------
   cal1  col2  col3  funcapplied
0     1   444   aaa          0.1
1     2   555    bb          0.2
2     3   666     c          0.3
3     4   444    dd          0.4
4     5   333  eeee          0.5
5     6   222   fff          0.6
6     7   666    gg          0.7
7     8   777     h          0.8
8     9   666   iii          0.9
9    10   555     j          1.0

In [71]:
df.sort_values(by='col2')

   cal1  col2  col3  funcapplied
5     6   222   fff          0.6
4     5   333  eeee          0.5
0     1   444   aaa          0.1
3     4   444    dd          0.4
1     2   555    bb          0.2
9    10   555     j          1.0
2     3   666     c          0.3
6     7   666    gg          0.7
8     9   666   iii          0.9
7     8   777     h          0.8

In [73]:
df.sort_values(by='funcapplied',ascending=False)

   cal1  col2  col3  funcapplied
9    10   555     j          1.0
8     9   666   iii          0.9
7     8   777     h          0.8
6     7   666    gg          0.7
5     6   222   fff          0.6
4     5   333  eeee          0.5
3     4   444    dd          0.4
2     3   666     c          0.3
1     2   555    bb          0.2
0     1   444   aaa          0.1

# Finding null value

In [74]:
df=pd.DataFrame({'col1':[1,2,np.nan,np.nan],
                'col2':[np.nan,555,666,444],
                 'col3':['abe','def','ghi','xyz']})
df

   col1   col2 col3
0   1.0    NaN  abe
1   2.0  555.0  def
2   NaN  666.0  ghi
3   NaN  444.0  xyz

In [78]:
df.isnull().sum()

col1    2
col2    1
col3    0
dtype: int64

In [83]:
df.fillna('888')

  col1 col2 col3
0    1  888  abe
1    2  555  def
2  888  666  ghi
3  888  444  xyz